app/views/songs/new.html.erb

              <label class="control-label">Album</label>
              <%= f.collection_select :album_id, Album.order(:title), :id, :title, {}, { class: "form-control" } %>
---
SELECT "albums".* FROM "albums" ORDER BY "albums"."title" ASC