app/views/albums/edit.html.erb


                <%= f.collection_select :band_id, Band.order(:name), :id, :name, {}, { class: "form-control" } %>
---
SELECT "bands".* FROM "bands" ORDER BY "bands"."name" ASC