app/controllers/albums_controller.rb

  def index
    #@albums = album.all
    @albums = Album.search(params[:term], params[:page])
---
SELECT  "albums".* FROM "albums" ORDER BY id DESC LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]

  def show
    @album = Album.find(params[:id])
    @songs = Song.where(album: @album)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."album_id" = ?  [["album_id", 1]]

  def create
    @album = Album.new(album_params)
    if @album.save
---
INSERT INTO "albums" ("title", "premiere_date", "band_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Mm"], ["premiere_date", "11111-11-11 00:00:00"], ["band_id", 2], ["created_at", "2018-05-23 17:27:35.688427"], ["updated_at", "2018-05-23 17:27:35.688427"]]

  def edit
    @album = Album.find(params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @album = Album.find(params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    @album = Album.find(params[:id])
    @album.destroy
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = ?  [["id", 1]]