app/controllers/bands_controller.rb

  def index
    #@bands = band.all
    @bands = Band.search(params[:term], params[:page])
---
SELECT  "bands".* FROM "bands" WHERE (name LIKE '%dasdasd%') ORDER BY id DESC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]

  def show
    @bands = Band.find(params[:id])
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

  def create
    @band = Band.new(band_params)
    if @band.save
---
INSERT INTO "bands" ("name", "date_created", "photo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Oszak"], ["date_created", "1995-12-30 00:00:00"], ["photo", "Moto"], ["created_at", "2018-05-19 16:13:40.878348"], ["updated_at", "2018-05-19 16:13:40.878348"]]

  def update
    @band = Band.find(params[:id])
    if @band.update_attributes(band_params)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "bands" SET "photo" = ?, "updated_at" = ? WHERE "bands"."id" = ?

  def destroy
    @band = Band.find(params[:id])
    @band.destroy
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = ?  [["id", 1]]