app/controllers/songs_controller.rb

  def index
    #@songs = Song.all
    @songs = Song.search(params[:term], params[:page])
---
SELECT  "songs".* FROM "songs" WHERE (title LIKE '%sds%') ORDER BY id DESC LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "songs"

  def show
    @songs = Song.find(params[:id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @song = Song.new(song_params)
    if @song.save
---
INSERT INTO "songs" ("title", "length", "lyrics", "album_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def edit
    @song = Song.find(params[:id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    @song = Song.find(params[:id])
    @song.destroy
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
DELETE FROM "songs" WHERE "songs"."id" = ?  [["id", 11]]